using System;

namespace QuickSort
{
    class Program
    {
        //2. Реализовать быструю сортировку.
        //КрюковВН
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
