using System;
using System.Collections.Generic;
using System.Linq;

namespace Graph
{
    class Program
    {
        //2. Написать рекурсивную функцию обхода графа в глубину.
        //3. Написать функцию обхода графа в ширину.
        //КрюковВН
        static void Main(string[] args)
        {
            FillGraph();
            Console.WriteLine("Hello World!");
        }

        public static void FillGraph() 
        {
            
        }
    }
}
